import programming from "src/assets/img/programming.png"
import UIUX from "src/assets/img/UIUX.png"
import WebDesign from "@/assets/img/WebDesign.png"


export const educationData = [
    {
        title: "Переваги спеціальності",
        info: <>Переваги спеціальності 186 Видавництво та поліграфія в тому, що спеціалізовані знання в області
            комп&apos;ютерної верстки та поліграфічних технологій «нанизуються» на фундаментальні знання в області
            комп&apos;ютерних наук в цілому. Сюди входить програмування, адміністрування комп&apos;ютерних систем, методи і засоби
            проектування інформаційних систем і технологій. <b>В основі навчального процесу лежить</b> вивчення основ
            композиції та технологій комп&apos;ютерного дизайну, комп&apos;ютерної анімації, UI/UX дизайну, додрукарського
            опрацювання інформації, інструментальних засобів WEB-дизайну, технологій 3D моделювання, проектування
            електронних і мультимедійних видань, інформаційних систем прийняття рішень та управління. </>,
    },
    {
        title: "Програмування",
        info: <>Під час навчання студенти вивчають сучасні технології створення прикладних програм, оволодівають
            навиками <b>об&apos;єктно-орієнтованого підходу до програмування</b> та роботи з <b>базами даних.</b> Для
            вивчення мов програмування <b>C/C++, C#, Java, Python</b> та ін. використовується найсучасніше апаратне та
            програмне забезпечення. Це є запорукою успішного застосування набутих знань при створенні програмного
            забезпечення в інформаційно-видавничих системах.</>,
        img: programming
    },
    {
        title: "UX/UI дизайн",
        info: <>При навчанні на спеціальності 186 «Видавництво та поліграфія» студенти опановують дисципліни, пов&apos;язані
            із UI/UX дизайном. При цьому вони вивчають теоретичні основи дизайну, технології роботи з елементами дизайну
            при розробці графічних проектів. Студенти опановують створення графічних композицій засобами <b>Adobe
                Photoshop, Adobe Illustrator</b> та іншими пакетами для оброблення графічної інформації. Велику увагу
            при підготовці студентів приділено електронним виданням: принципам їх побудови, їх складовим компонентам,
            особливостям апаратних засобів для відтворення електронних видань.</>,
        img: UIUX
    },
    {
        title: "Web-дизайн",
        info: <>Web-сайти, наприклад, є власне електронними виданнями, а тому <b>Web-дизайн</b> та реалізація <b>front-end
            для Web-проектів (засобами HTML5, CSS3, JavaScript)</b> також є частиною навчання студентів. Диплом
            бакалавра за спеціальністю 186 «Видавництво та поліграфія» дає можливість продовжити навчання на другому
            (магістерському) рівні вищої освіти.</>,
        img: WebDesign
    }
]
