import Logo1 from "src/assets/img/tabs/img_5.png"
import Logo2 from "src/assets/img/tabs/img_6.png"
import Logo3 from "src/assets/img/tabs/img_7.png"
import Logo4 from "src/assets/img/tabs/img_8.png"
import Logo5 from "src/assets/img/tabs/img_9.png"
import Logo6 from "src/assets/img/tabs/img_10.png"
import styles from "@/styles/card.module.scss";

export const partnersData = [
    {
        img: Logo1,
        title: "Корпорація «Глобал Лоджік» GlobalLogic, Inc.",
        info:
            <>
                GlobalLogic — міжнародна аутсорсингова IT-компанія, заснована в 2000 р. Має 19 підрозділів у дев’ятьох
                країнах на трьох континентах. Український підрозділ компанії налічує більше 1800 співробітників у Києві,
                Львові, Миколаєві та Харкові. <br/>
                <br/>
                <b>Тісна співпраця з НУ ЛП розпочалась у жовтні 2011 року,</b> коли компанія започаткувала проведення
                майстер
                класів в області ІТ для студентів університет. Основна тематика — це сучасні інформаційні технології та
                методи їх розробок, технологічні етапи та процеси розробки програмних систем, специфіка аналізу,
                проектування та тестування програмних рішень. Ці майстер класи проводяться один раз на тиждень протягом
                усього навчального року.<br/>
                <br/>
                Лекторами виступають керівники підрозділів та провідні фахівці компанії. У додаток до майстер-класів
                компанія GlobalLogic у січні 2012 року оголосила про набір студентів на безкоштовні підготовчі курси з
                мов програмування C/C++ та у лютому 2012 року відкрила на базі Інституту комп’ютерних наук і
                інформаційних технологій спеціалізовану лабораторія для організації діяльності та тренінгів.<br/>
                <br/>
                Щороку за результатами тренігів випускаются дві групи чисельністю <b>25 учасників.</b> Кращі випускники
                підготовчих курсів приймаються на роботу у компанію.
                <b>Останній випуск відбувся взимку 2016 року.</b>
            </>,
        buttonLink: "https://www.globallogic.com/ua/"
    },
    {
        img: Logo2,
        title: "Embrox Solutions",
        info:
            <>
                Компанія Embrox Solutions була створена в 2015 році, але її дружні стосунки з Львівською Політехнікою
                почалися ще задовго до того, адже багато випускників ВУЗу стали частиною Embrox команди. <br/>
                <br/>
                Embrox Solutions спеціалізується не лише на розробці програмного забезпечення, а й на електротехніці та
                механіці. Це означає, що, поєднуючи ці дисципліни, <b>Embrox реалізує повний цикл розробки,</b> від ідеї
                до
                повного апаратно-програмного продукту, готового до масового виробництва.<br/>
                <br/>
                Основними перевагами роботи в компанії є те, що можна побачити результат, а також часто ще й потримати
                його у руках.<br/>
                <br/>
                <b>Ми пишаємося тим, що є українською компанією.</b> Назва Embrox походить від слова “вишиванка”, де
                вкладені
                такі сенси як “вишивати кодом”, “мистецтво” та “дія”. Саме тому для нас важливий розвиток, стрімкий рух
                та творчість.<br/>
                <br/>
                Представники нашої компанії <b>регулярно проводять лекції та курси у Львівській Політехніці</b> на
                реальних
                кейсах, а також зараз готується нова програма і навчальні матеріали. Компанія Embrox завжди рада бачити
                в себе на стажуванні та подальшій роботі активних та перспективних студентів. Ми є прихильниками того,
                що найкращі знання здобуваються саме з практичним досвідом.<br/>
                <br/>
                Більше про нас ви можете дізнатися на сайті.
            </>,
        buttonLink: "https://embrox.com/"
    },
    {
        img: Logo3,
        title: "SoftServe",
        info:
            <>
                SoftServe — це технологічна компанія, заснована у 1993 році у Львові, Україна. Вона спеціалізується на
                консультуванні та розробці програмного забезпечення. SoftServe надає послуги у таких областях, як великі
                дані, Інтернет речей, хмарні обчислення, DevOps, електронна комерція, комп’ютерна безпека та дизайн
                користувацьких інтерфейсів. <br/>
                <br/>
                Їхні рішення охоплюють інженерні послуги, хмарні технології, розробку штучного інтелекту, аналітику
                великих даних, Інтернет речей та багато іншого. Ця компанія співпрацює з партнерами, такими як AWS, GCP,
                Microsoft, Salesforce та інші, щоб допомогти клієнтам в цифровій трансформації та конкурентному
                розвитку.
            </>,
        buttonLink: "https://www.softserveinc.com/uk-ua"
    },
    {
        img: Logo4,
        title: "Linkup Studio",
        info:
            <>
                <p className={styles.CardParagraph}>
                    Linkup Studio — це компанія, яка спеціалізується на розробці цифрових продуктів. Основні напрямки
                    діяльності включають:

                    <ol style={{paddingTop: "10px", paddingLeft: "15px"}}>
                        <li>
                            <b>Дизайн продукту:</b> Вони допомагають визначити ключові функції продукту та забезпечити
                            його
                            успіх.
                        </li>
                        <li>
                            <b>Розробка веб-сайтів та мобільних додатків:</b> Вони створюють інноваційні рішення для
                            клієнтів у
                            більш ніж 25 країнах.
                        </li>
                        <li>
                            <b>Розробка штучного інтелекту:</b> Вони будують AI-системи, які покращують ефективність
                            бізнес-операцій та генерують корисні дані.
                        </li>
                    </ol>
                </p>
            </>,
        buttonLink: "https://linkupst.com/"
    },
    {
        img: Logo5,
        title: "Lviv IT Cluster",
        info:
            <>
                Lviv IT Cluster — це найбільша технологічна асоціація в Україні, яка об’єднує понад 300 компаній та
                стартапів з більш ніж 90 000 спеціалістів. Кластер присвячений розвитку індустрії інформаційних
                технологій у регіоні та країні, співпрацюючи з урядовими та освітніми представниками. <br/>
                <br/>
                Вони активно впливають на бізнес-середовище міста та країни, сприяючи системним змінам. Кластер також
                проводить дослідження ІТ-ринку Львова, відслідковуючи динаміку розвитку цієї галузі. Їхні проекти, такі
                як IT Arena та Lviv Tech, сприяють просуванню місцевих ІТ-компаній на глобальному ринку.
            </>,
        buttonLink: "https://itcluster.lviv.ua/"
    },
    {
        img: Logo6,
        title: "UX/UI Design NULP",
        info:
            <>
                Програма “UX/UI DESIGN” навчає студентів розробляти інтерфейси для програм, додатків та веб-сайтів.
                UX-фахівці зосереджуються на ефективності продукту, враховуючи потреби користувачів та бізнес-цілі
                компанії. UI-дизайнери відповідають за вигляд інтерфейсу, включаючи кольори, форми та інші візуальні
                елементи.
            </>,
        buttonLink: "https://itcluster.lviv.ua/ux-ui_nulp/"
    },
]
